{
  "irVersion": "1.0.0",
  "normalizedAt": "2025-10-19T20:08:46.120Z",
  "source": {
    "snapshotChecksum": "48a68dbc1353e47c18edf6c4a5a60d52c61737ee3eb7ed01c597f8e6058c81b2",
    "scrapedAt": "2025-10-19T20:08:38.846Z",
    "sourceUrl": "https://pve.proxmox.com/pve-docs/api-viewer/",
    "documentTitle": "Proxmox VE API Documentation",
    "rawStats": {
      "rootGroupCount": 6,
      "endpointCount": 628
    }
  },
  "summary": {
    "groupCount": 412,
    "endpointCount": 628,
    "methodCount": 628
  },
  "groups": [
    {
      "id": "access",
      "path": "/access",
      "slug": "access",
      "label": "access",
      "endpoints": [
        {
          "id": "get-access",
          "operationId": "get-access",
          "path": "/access",
          "httpMethod": "GET",
          "name": "index",
          "description": "Directory index.",
          "security": {
            "allowToken": true,
            "requiresAuthentication": false,
            "permissions": {
              "all": [
                {
                  "user": "all"
                }
              ]
            }
          },
          "features": {
            "proxy": false,
            "download": false,
            "upload": false
          },
          "request": {
            "schema": {
              "additionalProperties": false
            }
          },
          "responses": [
            {
              "schema": {
                "type": "array",
                "items": {
                  "type": "object",
                  "properties": {
                    "subdir": {
                      "type": "string"
                    }
                  }
                },
                "metadata": {
                  "links": [
                    {
                      "href": "{subdir}",
                      "rel": "child"
                    }
                  ]
                }
              }
            }
          ]
        }
      ],
      "children": [
        {
          "id": "access-acl",
          "path": "/access/acl",
          "slug": "access-acl",
          "label": "acl",
          "endpoints": [
            {
              "id": "get-access-acl",
              "operationId": "get-access-acl",
              "path": "/access/acl",
              "httpMethod": "GET",
              "name": "read_acl",
              "description": "Get Access Control List (ACLs).",
              "security": {
                "allowToken": true,
                "requiresAuthentication": false,
                "permissions": {
                  "all": [
                    {
                      "description": "The returned list is restricted to objects where you have rights to modify permissions.",
                      "user": "all"
                    }
                  ]
                }
              },
              "features": {
                "proxy": false,
                "download": false,
                "upload": false
              },
              "request": {
                "schema": {
                  "additionalProperties": false
                }
              },
              "responses": [
                {
                  "schema": {
                    "type": "array",
                    "items": {
                      "type": "object",
                      "properties": {
                        "path": {
                          "type": "string",
                          "description": "Access control path"
                        },
                        "propagate": {
                          "type": "boolean",
                          "description": "Allow to propagate (inherit) permissions.",
                          "optional": true,
                          "defaultValue": 1
                        },
                        "roleid": {
                          "type": "string"
                        },
                        "type": {
                          "type": "string",
                          "enum": [
                            "user",
                            "group",
                            "token"
                          ]
                        },
                        "ugid": {
                          "type": "string"
                        }
                      },
                      "additionalProperties": false
                    }
                  }
                }
              ]
            },
            {
              "id": "put-access-acl",
              "operationId": "put-access-acl",
              "path": "/access/acl",
              "httpMethod": "PUT",
              "name": "update_acl",
              "description": "Update Access Control List (add or remove permissions).",
              "security": {
                "allowToken": true,
                "requiresAuthentication": true,
                "permissions": {
                  "all": [
                    {
                      "check": [
                        "perm-modify",
                        "{path}"
                      ]
                    }
                  ]
                }
              },
              "features": {
                "proxy": false,
                "download": false,
                "upload": false
              },
              "request": {
                "schema": {
                  "properties": {
                    "delete": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Remove permissions (instead of adding it).",
                      "optional": true
                    },
                    "groups": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "List of groups.",
                      "optional": true,
                      "constraints": {
                        "format": "pve-groupid-list"
                      }
                    },
                    "path": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Access control path"
                    },
                    "propagate": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Allow to propagate (inherit) permissions.",
                      "optional": true,
                      "defaultValue": 1
                    },
                    "roles": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "List of roles.",
                      "constraints": {
                        "format": "pve-roleid-list"
                      }
                    },
                    "tokens": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "List of API tokens.",
                      "optional": true,
                      "constraints": {
                        "format": "pve-tokenid-list"
                      }
                    },
                    "users": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "List of users.",
                      "optional": true,
                      "constraints": {
                        "format": "pve-userid-list"
                      }
                    }
                  },
                  "additionalProperties": false
                }
              },
              "responses": [
                {
                  "schema": {
                    "type": "null"
                  }
                }
              ]
            }
          ],
          "children": []
        },
        {
          "id": "access-domains",
          "path": "/access/domains",
          "slug": "access-domains",
          "label": "domains",
          "endpoints": [
            {
              "id": "get-access-domains",
              "operationId": "get-access-domains",
              "path": "/access/domains",
              "httpMethod": "GET",
              "name": "index",
              "description": "Authentication domain index.",
              "security": {
                "allowToken": true,
                "requiresAuthentication": false,
                "permissions": {
                  "all": [
                    {
                      "description": "Anyone can access that, because we need that list for the login box (before the user is authenticated).",
                      "user": "world"
                    }
                  ]
                }
              },
              "features": {
                "proxy": false,
                "download": false,
                "upload": false
              },
              "request": {
                "schema": {
                  "additionalProperties": false
                }
              },
              "responses": [
                {
                  "schema": {
                    "type": "array",
                    "items": {
                      "type": "object",
                      "properties": {
                        "comment": {
                          "type": "string",
                          "description": "A comment. The GUI use this text when you select a domain (Realm) on the login window.",
                          "optional": true
                        },
                        "realm": {
                          "type": "string"
                        },
                        "tfa": {
                          "type": "string",
                          "description": "Two-factor authentication provider.",
                          "optional": true,
                          "enum": [
                            "yubico",
                            "oath"
                          ]
                        },
                        "type": {
                          "type": "string"
                        }
                      }
                    },
                    "metadata": {
                      "links": [
                        {
                          "href": "{realm}",
                          "rel": "child"
                        }
                      ]
                    }
                  }
                }
              ]
            },
            {
              "id": "post-access-domains",
              "operationId": "post-access-domains",
              "path": "/access/domains",
              "httpMethod": "POST",
              "name": "create",
              "description": "Add an authentication server.",
              "security": {
                "allowToken": true,
                "requiresAuthentication": true,
                "permissions": {
                  "all": [
                    {
                      "check": [
                        "perm",
                        "/access/realm",
                        [
                          "Realm.Allocate"
                        ]
                      ]
                    }
                  ]
                }
              },
              "features": {
                "proxy": false,
                "download": false,
                "upload": false
              },
              "request": {
                "schema": {
                  "type": "object",
                  "properties": {
                    "acr-values": {
                      "type": "string",
                      "description": "Specifies the Authentication Context Class Reference values that theAuthorization Server is being requested to use for the Auth Request.",
                      "optional": true,
                      "constraints": {
                        "pattern": "^[^\\x00-\\x1F\\x7F <>#\"]*$"
                      }
                    },
                    "autocreate": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Automatically create users if they do not exist.",
                      "optional": true,
                      "defaultValue": 0
                    },
                    "base_dn": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "LDAP base domain name",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256
                      }
                    },
                    "bind_dn": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "LDAP bind domain name",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256
                      }
                    },
                    "capath": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Path to the CA certificate store",
                      "optional": true,
                      "defaultValue": "/etc/ssl/certs"
                    },
                    "case-sensitive": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "username is case-sensitive",
                      "optional": true,
                      "defaultValue": 1
                    },
                    "cert": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Path to the client certificate",
                      "optional": true
                    },
                    "certkey": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Path to the client certificate key",
                      "optional": true
                    },
                    "check-connection": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Check bind connection to the server.",
                      "optional": true,
                      "defaultValue": 0
                    },
                    "client-id": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "OpenID Client ID",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256
                      }
                    },
                    "client-key": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "OpenID Client Key",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256
                      }
                    },
                    "comment": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Description.",
                      "optional": true,
                      "constraints": {
                        "maxLength": 4096
                      }
                    },
                    "default": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Use this as default realm",
                      "optional": true
                    },
                    "domain": {
                      "type": "string",
                      "description": "AD domain name",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256,
                        "pattern": "\\S+"
                      }
                    },
                    "filter": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "LDAP filter for user sync.",
                      "optional": true,
                      "constraints": {
                        "maxLength": 2048
                      }
                    },
                    "group_classes": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "The objectclasses for groups.",
                      "optional": true,
                      "defaultValue": "groupOfNames, group, univentionGroup, ipausergroup",
                      "constraints": {
                        "format": "ldap-simple-attr-list"
                      }
                    },
                    "group_dn": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "LDAP base domain name for group sync. If not set, the base_dn will be used.",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256
                      }
                    },
                    "group_filter": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "LDAP filter for group sync.",
                      "optional": true,
                      "constraints": {
                        "maxLength": 2048
                      }
                    },
                    "group_name_attr": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "LDAP attribute representing a groups name. If not set or found, the first value of the DN will be used as name.",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256,
                        "format": "ldap-simple-attr"
                      }
                    },
                    "groups-autocreate": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Automatically create groups if they do not exist.",
                      "optional": true,
                      "defaultValue": 0
                    },
                    "groups-claim": {
                      "type": "string",
                      "description": "OpenID claim used to retrieve groups with.",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256,
                        "pattern": "(?^:[A-Za-z0-9\\.\\-_]+)"
                      }
                    },
                    "groups-overwrite": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "All groups will be overwritten for the user on login.",
                      "optional": true,
                      "defaultValue": 0
                    },
                    "issuer-url": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "OpenID Issuer Url",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256
                      }
                    },
                    "mode": {
                      "type": "string",
                      "description": "LDAP protocol mode.",
                      "optional": true,
                      "defaultValue": "ldap",
                      "enum": [
                        "ldap",
                        "ldaps",
                        "ldap+starttls"
                      ]
                    },
                    "password": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "LDAP bind password. Will be stored in '/etc/pve/priv/realm/<REALM>.pw'.",
                      "optional": true
                    },
                    "port": {
                      "type": "integer",
                      "typetext": "<integer> (1 - 65535)",
                      "description": "Server port.",
                      "optional": true,
                      "constraints": {
                        "minimum": 1,
                        "maximum": 65535
                      }
                    },
                    "prompt": {
                      "type": "string",
                      "description": "Specifies whether the Authorization Server prompts the End-User for reauthentication and consent.",
                      "optional": true,
                      "constraints": {
                        "pattern": "(?:none|login|consent|select_account|\\S+)"
                      }
                    },
                    "query-userinfo": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Enables querying the userinfo endpoint for claims values.",
                      "optional": true,
                      "defaultValue": 1
                    },
                    "realm": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Authentication domain ID",
                      "constraints": {
                        "maxLength": 32,
                        "format": "pve-realm"
                      }
                    },
                    "scopes": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Specifies the scopes (user details) that should be authorized and returned, for example 'email' or 'profile'.",
                      "optional": true,
                      "defaultValue": "email profile"
                    },
                    "secure": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Use secure LDAPS protocol. DEPRECATED: use 'mode' instead.",
                      "optional": true
                    },
                    "server1": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Server IP address (or DNS name)",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256,
                        "format": "address"
                      }
                    },
                    "server2": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "Fallback Server IP address (or DNS name)",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256,
                        "format": "address"
                      }
                    },
                    "sslversion": {
                      "type": "string",
                      "description": "LDAPS TLS/SSL version. It's not recommended to use version older than 1.2!",
                      "optional": true,
                      "enum": [
                        "tlsv1",
                        "tlsv1_1",
                        "tlsv1_2",
                        "tlsv1_3"
                      ]
                    },
                    "sync-defaults-options": {
                      "type": "string",
                      "typetext": "[enable-new=<1|0>] [,full=<1|0>] [,purge=<1|0>] [,remove-vanished=([acl];[properties];[entry])|none] [,scope=<users|groups|both>]",
                      "description": "The default options for behavior of synchronizations.",
                      "optional": true,
                      "constraints": {
                        "format": "realm-sync-options"
                      }
                    },
                    "sync_attributes": {
                      "type": "string",
                      "description": "Comma separated list of key=value pairs for specifying which LDAP attributes map to which PVE user field. For example, to map the LDAP attribute 'mail' to PVEs 'email', write  'email=mail'. By default, each PVE user field is represented  by an LDAP attribute of the same name.",
                      "optional": true,
                      "constraints": {
                        "pattern": "\\w+=[^,]+(,\\s*\\w+=[^,]+)*"
                      }
                    },
                    "tfa": {
                      "type": "string",
                      "typetext": "type=<TFATYPE> [,digits=<COUNT>] [,id=<ID>] [,key=<KEY>] [,step=<SECONDS>] [,url=<URL>]",
                      "description": "Use Two-factor authentication.",
                      "optional": true,
                      "constraints": {
                        "maxLength": 128,
                        "format": "pve-tfa-config"
                      }
                    },
                    "type": {
                      "type": "string",
                      "description": "Realm type.",
                      "enum": [
                        "ad",
                        "ldap",
                        "openid",
                        "pam",
                        "pve"
                      ]
                    },
                    "user_attr": {
                      "type": "string",
                      "description": "LDAP user attribute name",
                      "optional": true,
                      "constraints": {
                        "maxLength": 256,
                        "pattern": "\\S{2,}"
                      }
                    },
                    "user_classes": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "The objectclasses for users.",
                      "optional": true,
                      "defaultValue": "inetorgperson, posixaccount, person, user",
                      "constraints": {
                        "format": "ldap-simple-attr-list"
                      }
                    },
                    "username-claim": {
                      "type": "string",
                      "typetext": "<string>",
                      "description": "OpenID claim used to generate the unique username.",
                      "optional": true
                    },
                    "verify": {
                      "type": "boolean",
                      "typetext": "<boolean>",
                      "description": "Verify the server's SSL certificate",
                      "optional": true,
                      "defaultValue": 0
                    }
                  },
                  "additionalProperties": false
                }
              },
              "responses": [
                {
                  "schema": {
                    "type": "null"
                  }
                }
              ]
            }
          ],
          "children": [
            {
              "id": "access-domains-realm",
              "path": "/access/domains/{realm}",
              "slug": "access-domains-realm",
              "label": "{realm}",
              "endpoints": [
                {
                  "id": "delete-access-domains-realm",
                  "operationId": "delete-access-domains-realm",
                  "path": "/access/domains/{realm}",
                  "httpMethod": "DELETE",
                  "name": "delete",
                  "description": "Delete an authentication server.",
                  "security": {
                    "allowToken": true,
                    "requiresAuthentication": true,
                    "permissions": {
                      "all": [
                        {
                          "check": [
                            "perm",
                            "/access/realm",
                            [
                              "Realm.Allocate"
                            ]
                          ]
                        }
                      ]
                    }
                  },
                  "features": {
                    "proxy": false,
                    "download": false,
                    "upload": false
                  },
                  "request": {
                    "schema": {
                      "properties": {
                        "realm": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Authentication domain ID",
                          "constraints": {
                            "maxLength": 32,
                            "format": "pve-realm"
                          }
                        }
                      },
                      "additionalProperties": false
                    }
                  },
                  "responses": [
                    {
                      "schema": {
                        "type": "null"
                      }
                    }
                  ]
                },
                {
                  "id": "get-access-domains-realm",
                  "operationId": "get-access-domains-realm",
                  "path": "/access/domains/{realm}",
                  "httpMethod": "GET",
                  "name": "read",
                  "description": "Get auth server configuration.",
                  "security": {
                    "allowToken": true,
                    "requiresAuthentication": false,
                    "permissions": {
                      "all": [
                        {
                          "check": [
                            "perm",
                            "/access/realm",
                            [
                              "Realm.Allocate",
                              "Sys.Audit"
                            ],
                            "any",
                            1
                          ]
                        }
                      ]
                    }
                  },
                  "features": {
                    "proxy": false,
                    "download": false,
                    "upload": false
                  },
                  "request": {
                    "schema": {
                      "properties": {
                        "realm": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Authentication domain ID",
                          "constraints": {
                            "maxLength": 32,
                            "format": "pve-realm"
                          }
                        }
                      },
                      "additionalProperties": false
                    }
                  },
                  "responses": []
                },
                {
                  "id": "put-access-domains-realm",
                  "operationId": "put-access-domains-realm",
                  "path": "/access/domains/{realm}",
                  "httpMethod": "PUT",
                  "name": "update",
                  "description": "Update authentication server settings.",
                  "security": {
                    "allowToken": true,
                    "requiresAuthentication": true,
                    "permissions": {
                      "all": [
                        {
                          "check": [
                            "perm",
                            "/access/realm",
                            [
                              "Realm.Allocate"
                            ]
                          ]
                        }
                      ]
                    }
                  },
                  "features": {
                    "proxy": false,
                    "download": false,
                    "upload": false
                  },
                  "request": {
                    "schema": {
                      "type": "object",
                      "properties": {
                        "acr-values": {
                          "type": "string",
                          "description": "Specifies the Authentication Context Class Reference values that theAuthorization Server is being requested to use for the Auth Request.",
                          "optional": true,
                          "constraints": {
                            "pattern": "^[^\\x00-\\x1F\\x7F <>#\"]*$"
                          }
                        },
                        "autocreate": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "Automatically create users if they do not exist.",
                          "optional": true,
                          "defaultValue": 0
                        },
                        "base_dn": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "LDAP base domain name",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256
                          }
                        },
                        "bind_dn": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "LDAP bind domain name",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256
                          }
                        },
                        "capath": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Path to the CA certificate store",
                          "optional": true,
                          "defaultValue": "/etc/ssl/certs"
                        },
                        "case-sensitive": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "username is case-sensitive",
                          "optional": true,
                          "defaultValue": 1
                        },
                        "cert": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Path to the client certificate",
                          "optional": true
                        },
                        "certkey": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Path to the client certificate key",
                          "optional": true
                        },
                        "check-connection": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "Check bind connection to the server.",
                          "optional": true,
                          "defaultValue": 0
                        },
                        "client-id": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "OpenID Client ID",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256
                          }
                        },
                        "client-key": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "OpenID Client Key",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256
                          }
                        },
                        "comment": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Description.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 4096
                          }
                        },
                        "default": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "Use this as default realm",
                          "optional": true
                        },
                        "delete": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "A list of settings you want to delete.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 4096,
                            "format": "pve-configid-list"
                          }
                        },
                        "digest": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Prevent changes if current configuration file has a different digest. This can be used to prevent concurrent modifications.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 64
                          }
                        },
                        "domain": {
                          "type": "string",
                          "description": "AD domain name",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256,
                            "pattern": "\\S+"
                          }
                        },
                        "filter": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "LDAP filter for user sync.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 2048
                          }
                        },
                        "group_classes": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "The objectclasses for groups.",
                          "optional": true,
                          "defaultValue": "groupOfNames, group, univentionGroup, ipausergroup",
                          "constraints": {
                            "format": "ldap-simple-attr-list"
                          }
                        },
                        "group_dn": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "LDAP base domain name for group sync. If not set, the base_dn will be used.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256
                          }
                        },
                        "group_filter": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "LDAP filter for group sync.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 2048
                          }
                        },
                        "group_name_attr": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "LDAP attribute representing a groups name. If not set or found, the first value of the DN will be used as name.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256,
                            "format": "ldap-simple-attr"
                          }
                        },
                        "groups-autocreate": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "Automatically create groups if they do not exist.",
                          "optional": true,
                          "defaultValue": 0
                        },
                        "groups-claim": {
                          "type": "string",
                          "description": "OpenID claim used to retrieve groups with.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256,
                            "pattern": "(?^:[A-Za-z0-9\\.\\-_]+)"
                          }
                        },
                        "groups-overwrite": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "All groups will be overwritten for the user on login.",
                          "optional": true,
                          "defaultValue": 0
                        },
                        "issuer-url": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "OpenID Issuer Url",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256
                          }
                        },
                        "mode": {
                          "type": "string",
                          "description": "LDAP protocol mode.",
                          "optional": true,
                          "defaultValue": "ldap",
                          "enum": [
                            "ldap",
                            "ldaps",
                            "ldap+starttls"
                          ]
                        },
                        "password": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "LDAP bind password. Will be stored in '/etc/pve/priv/realm/<REALM>.pw'.",
                          "optional": true
                        },
                        "port": {
                          "type": "integer",
                          "typetext": "<integer> (1 - 65535)",
                          "description": "Server port.",
                          "optional": true,
                          "constraints": {
                            "minimum": 1,
                            "maximum": 65535
                          }
                        },
                        "prompt": {
                          "type": "string",
                          "description": "Specifies whether the Authorization Server prompts the End-User for reauthentication and consent.",
                          "optional": true,
                          "constraints": {
                            "pattern": "(?:none|login|consent|select_account|\\S+)"
                          }
                        },
                        "query-userinfo": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "Enables querying the userinfo endpoint for claims values.",
                          "optional": true,
                          "defaultValue": 1
                        },
                        "realm": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Authentication domain ID",
                          "constraints": {
                            "maxLength": 32,
                            "format": "pve-realm"
                          }
                        },
                        "scopes": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Specifies the scopes (user details) that should be authorized and returned, for example 'email' or 'profile'.",
                          "optional": true,
                          "defaultValue": "email profile"
                        },
                        "secure": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "Use secure LDAPS protocol. DEPRECATED: use 'mode' instead.",
                          "optional": true
                        },
                        "server1": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Server IP address (or DNS name)",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256,
                            "format": "address"
                          }
                        },
                        "server2": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "Fallback Server IP address (or DNS name)",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256,
                            "format": "address"
                          }
                        },
                        "sslversion": {
                          "type": "string",
                          "description": "LDAPS TLS/SSL version. It's not recommended to use version older than 1.2!",
                          "optional": true,
                          "enum": [
                            "tlsv1",
                            "tlsv1_1",
                            "tlsv1_2",
                            "tlsv1_3"
                          ]
                        },
                        "sync-defaults-options": {
                          "type": "string",
                          "typetext": "[enable-new=<1|0>] [,full=<1|0>] [,purge=<1|0>] [,remove-vanished=([acl];[properties];[entry])|none] [,scope=<users|groups|both>]",
                          "description": "The default options for behavior of synchronizations.",
                          "optional": true,
                          "constraints": {
                            "format": "realm-sync-options"
                          }
                        },
                        "sync_attributes": {
                          "type": "string",
                          "description": "Comma separated list of key=value pairs for specifying which LDAP attributes map to which PVE user field. For example, to map the LDAP attribute 'mail' to PVEs 'email', write  'email=mail'. By default, each PVE user field is represented  by an LDAP attribute of the same name.",
                          "optional": true,
                          "constraints": {
                            "pattern": "\\w+=[^,]+(,\\s*\\w+=[^,]+)*"
                          }
                        },
                        "tfa": {
                          "type": "string",
                          "typetext": "type=<TFATYPE> [,digits=<COUNT>] [,id=<ID>] [,key=<KEY>] [,step=<SECONDS>] [,url=<URL>]",
                          "description": "Use Two-factor authentication.",
                          "optional": true,
                          "constraints": {
                            "maxLength": 128,
                            "format": "pve-tfa-config"
                          }
                        },
                        "user_attr": {
                          "type": "string",
                          "description": "LDAP user attribute name",
                          "optional": true,
                          "constraints": {
                            "maxLength": 256,
                            "pattern": "\\S{2,}"
                          }
                        },
                        "user_classes": {
                          "type": "string",
                          "typetext": "<string>",
                          "description": "The objectclasses for users.",
                          "optional": true,
                          "defaultValue": "inetorgperson, posixaccount, person, user",
                          "constraints": {
                            "format": "ldap-simple-attr-list"
                          }
                        },
                        "verify": {
                          "type": "boolean",
                          "typetext": "<boolean>",
                          "description": "Verify the server's SSL certificate",
                          "optional": true,
                          "defaultValue": 0
                        }
                      },
                      "additionalProperties": false
                    }
                  },
                  "responses": [
                    {
                      "schema": {
                        "type": "null"
                      }
                    }
                  ]
                }
              ],
              "children": [
                {
                  "id": "access-domains-realm-sync",
